{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.4.0", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "Conv2D", "config": {"name": "conv2d", "trainable": true, "batch_input_shape": [null, 200, 200, 3], "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d", "trainable": true, "dtype": "float32", "pool_size": [4, 4], "padding": "valid", "strides": [4, 4], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_3", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "trainable": true, "dtype": "float32", "pool_size": [4, 4], "padding": "valid", "strides": [4, 4], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_4", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_5", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "trainable": true, "dtype": "float32", "pool_size": [4, 4], "padding": "valid", "strides": [4, 4], "data_format": "channels_last"}}, {"class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 4096, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 4096, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 1000, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "dtype": "float32", "units": 5, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"loss": "categorical_crossentropy", "metrics": ["accuracy"], "weighted_metrics": null, "sample_weight_mode": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0010000000474974513, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["model.bin"], "weights": [{"name": "conv2d/kernel", "shape": [3, 3, 3, 32], "dtype": "float32", "quantization": {"min": -0.22423863942716635, "scale": 0.001853211896092284, "dtype": "uint8"}}, {"name": "conv2d/bias", "shape": [32], "dtype": "float32", "quantization": {"min": -0.06297473225231263, "scale": 0.0003770942051036685, "dtype": "uint8"}}, {"name": "conv2d_1/kernel", "shape": [3, 3, 32, 32], "dtype": "float32", "quantization": {"min": -0.23093660029710508, "scale": 0.0017764353869008083, "dtype": "uint8"}}, {"name": "conv2d_1/bias", "shape": [32], "dtype": "float32", "quantization": {"min": -0.030914889977258792, "scale": 0.00033241817179848165, "dtype": "uint8"}}, {"name": "conv2d_2/kernel", "shape": [3, 3, 32, 64], "dtype": "float32", "quantization": {"min": -0.243918222656437, "scale": 0.0017804249828937007, "dtype": "uint8"}}, {"name": "conv2d_2/bias", "shape": [64], "dtype": "float32", "quantization": {"min": -0.04189972481599041, "scale": 0.0003058374074159884, "dtype": "uint8"}}, {"name": "conv2d_3/kernel", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"min": -0.2920059531927109, "scale": 0.001986435055732727, "dtype": "uint8"}}, {"name": "conv2d_3/bias", "shape": [64], "dtype": "float32", "quantization": {"min": -0.05613314995870871, "scale": 0.0002954376313616248, "dtype": "uint8"}}, {"name": "conv2d_4/kernel", "shape": [3, 3, 64, 128], "dtype": "float32", "quantization": {"min": -0.24872412722484738, "scale": 0.001989793017798779, "dtype": "uint8"}}, {"name": "conv2d_4/bias", "shape": [128], "dtype": "float32", "quantization": {"min": -0.05762905539835201, "scale": 0.0003557349098663704, "dtype": "uint8"}}, {"name": "conv2d_5/kernel", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"min": -0.2603821978849523, "scale": 0.0019005999845616958, "dtype": "uint8"}}, {"name": "conv2d_5/bias", "shape": [128], "dtype": "float32", "quantization": {"min": -0.0722165724810432, "scale": 0.00037612798167209997, "dtype": "uint8"}}, {"name": "dense/kernel", "shape": [1152, 4096], "dtype": "float32", "quantization": {"min": -0.30348238261306987, "scale": 0.0021523573234969494, "dtype": "uint8"}}, {"name": "dense/bias", "shape": [4096], "dtype": "float32", "quantization": {"min": -0.07689834630080297, "scale": 0.0004717689957104477, "dtype": "uint8"}}, {"name": "dense_1/kernel", "shape": [4096, 4096], "dtype": "float32", "quantization": {"min": -0.2068734153813007, "scale": 0.001951635994163214, "dtype": "uint8"}}, {"name": "dense_1/bias", "shape": [4096], "dtype": "float32", "quantization": {"min": -0.06646838801748613, "scale": 0.0005233731339959537, "dtype": "uint8"}}, {"name": "dense_2/kernel", "shape": [4096, 1000], "dtype": "float32", "quantization": {"min": -0.15946136713027956, "scale": 0.0013987839221954346, "dtype": "uint8"}}, {"name": "dense_2/bias", "shape": [1000], "dtype": "float32", "quantization": {"min": -0.059187412919367056, "scale": 0.00043842528088420044, "dtype": "uint8"}}, {"name": "dense_3/kernel", "shape": [1000, 5], "dtype": "float32", "quantization": {"min": -0.16082045777755627, "scale": 0.0010114494199846306, "dtype": "uint8"}}, {"name": "dense_3/bias", "shape": [5], "dtype": "float32", "quantization": {"min": -0.015312377611796062, "scale": 0.00011962795009215673, "dtype": "uint8"}}]}]}
