{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v1.4.0", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "Conv2D", "config": {"name": "conv2d", "trainable": true, "batch_input_shape": [null, 200, 200, 3], "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d", "trainable": true, "dtype": "float32", "pool_size": [4, 4], "padding": "valid", "strides": [4, 4], "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_3", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "trainable": true, "dtype": "float32", "pool_size": [4, 4], "padding": "valid", "strides": [4, 4], "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_4", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_5", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}}, {"class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 4096, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 4096, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 1000, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "dtype": "float32", "units": 5, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"loss": "categorical_crossentropy", "metrics": ["accuracy"], "weighted_metrics": null, "sample_weight_mode": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 9.999999747378752e-05, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["model.bin"], "weights": [{"name": "conv2d/kernel", "shape": [3, 3, 3, 32], "dtype": "float32", "quantization": {"min": -0.2316976493480159, "scale": 0.001654983209628685, "dtype": "uint8"}}, {"name": "conv2d/bias", "shape": [32], "dtype": "float32", "quantization": {"min": -0.07722282497321858, "scale": 0.0006773932015194613, "dtype": "uint8"}}, {"name": "conv2d_1/kernel", "shape": [3, 3, 32, 32], "dtype": "float32", "quantization": {"min": -0.3192966614283767, "scale": 0.002514146940380919, "dtype": "uint8"}}, {"name": "conv2d_1/bias", "shape": [32], "dtype": "float32", "quantization": {"min": -0.051794922381055125, "scale": 0.00033416078955519435, "dtype": "uint8"}}, {"name": "conv2d_2/kernel", "shape": [3, 3, 32, 64], "dtype": "float32", "quantization": {"min": -0.30413942056543686, "scale": 0.0021120793094822005, "dtype": "uint8"}}, {"name": "conv2d_2/bias", "shape": [64], "dtype": "float32", "quantization": {"min": -0.06648670855690451, "scale": 0.0004403093281914206, "dtype": "uint8"}}, {"name": "conv2d_3/kernel", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"min": -0.3239939752747031, "scale": 0.002347782429526834, "dtype": "uint8"}}, {"name": "conv2d_3/bias", "shape": [64], "dtype": "float32", "quantization": {"min": -0.05626688213909374, "scale": 0.00026049482471802657, "dtype": "uint8"}}, {"name": "conv2d_4/kernel", "shape": [3, 3, 64, 128], "dtype": "float32", "quantization": {"min": -0.2956669693484026, "scale": 0.0020969288606269686, "dtype": "uint8"}}, {"name": "conv2d_4/bias", "shape": [128], "dtype": "float32", "quantization": {"min": -0.06060384464468442, "scale": 0.00035860263103363563, "dtype": "uint8"}}, {"name": "conv2d_5/kernel", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"min": -0.23492711443527073, "scale": 0.0017933367514142804, "dtype": "uint8"}}, {"name": "conv2d_5/bias", "shape": [128], "dtype": "float32", "quantization": {"min": -0.056756821932161555, "scale": 0.00030514420393635243, "dtype": "uint8"}}, {"name": "dense/kernel", "shape": [4608, 4096], "dtype": "float32", "quantization": {"min": -0.3045862786910113, "scale": 0.002307471808265237, "dtype": "uint8"}}, {"name": "dense/bias", "shape": [4096], "dtype": "float32", "quantization": {"min": -0.11757182833902975, "scale": 0.0006875545516902325, "dtype": "uint8"}}, {"name": "dense_1/kernel", "shape": [4096, 4096], "dtype": "float32", "quantization": {"min": -0.2423279238097808, "scale": 0.0020711788359810326, "dtype": "uint8"}}, {"name": "dense_1/bias", "shape": [4096], "dtype": "float32", "quantization": {"min": -0.08928646343011482, "scale": 0.0006713267927076302, "dtype": "uint8"}}, {"name": "dense_2/kernel", "shape": [4096, 1000], "dtype": "float32", "quantization": {"min": -0.18953726472807866, "scale": 0.0016773209267971563, "dtype": "uint8"}}, {"name": "dense_2/bias", "shape": [1000], "dtype": "float32", "quantization": {"min": -0.04643676054536128, "scale": 0.0004339884163117876, "dtype": "uint8"}}, {"name": "dense_3/kernel", "shape": [1000, 5], "dtype": "float32", "quantization": {"min": -0.16339240635142607, "scale": 0.00113466948855157, "dtype": "uint8"}}, {"name": "dense_3/bias", "shape": [5], "dtype": "float32", "quantization": {"min": -0.021369283310338563, "scale": 0.0001723329299220852, "dtype": "uint8"}}]}]}
